hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/drivers/src/nrfx_twis.c
    This function calls @ref nrf_twis_event_get function but the the result
    is shifted to match INTEN register scheme.

    @param[in,out] p_reg TWIS to read  event from
    @param ev  Event code

    @return Selected event state shifted by @ref nrfx_event_to_bitpos

    @sa nrf_twis_event_get
    @sa nrfx_event_to_bitpos
*/
static inline uint32_t nrfx_twis_event_bit_get(NRF_TWIS_Type   *p_reg,
                                               nrf_twis_event_t ev)
{
    return (uint32_t)nrf_twis_event_get_and_clear(p_reg, ev) << nrfx_event_to_bitpos(ev);
}

/**
    @brief Auxiliary function for checking event bit inside given flags value

    Function used here to check presence of the event inside given flags value.
    It transforms given event to bit possition and then checks if in given variable it is cleared.

    @param flags Flags to test
    @param ev Event code

    @retval true Flag for selected event is set
    @retval false Flag for selected event is cleared
*/
static inline bool nrfx_twis_check_bit(uint32_t         flags,
                                       nrf_twis_event_t ev)
{
    return 0 != (flags & (1U << nrfx_event_to_bitpos(ev)));
}

/**
    @brief Auxiliary function for clearing event bit in given flags value

    Function used to clear selected event bit.

    @param flags Flags to process
    @param ev    Event code to clear

    @return Value @em flags with cleared event bit that matches given @em ev
*/
static inline uint32_t nrfx_twis_clear_bit(uint32_t         flags,
                                           nrf_twis_event_t ev)
{
    return flags & ~(1U << nrfx_event_to_bitpos(ev));
}

static void call_event_handler(twis_control_block_t const *p_cb,
                               nrfx_twis_evt_t const       *p_evt)
{
    nrfx_twis_event_handler_t handler = p_cb->ev_handler;
    
    if(handler != NULL)
        handler(p_evt);
}

/**
    @brief Auxiliary function for error processing

    Function called when in current substate the event apears and it cannot be processed.
    It should be called also on ERROR event.
    If given @em error parameter has zero value the @ref NRFX_TWIS_ERROR_UNEXPECTED_EVENT
    would be set.

    @param p_cb   Pointer to the driver instance control block.
    @param evt    What error event raport to event handler
    @param error  Error flags
*/
static inline void nrfx_twis_process_error(twis_control_block_t *p_cb,
                                           nrfx_twis_evt_type_t   evt,
                                           uint32_t               error)
{
    if(0 == error)
        error = NRFX_TWIS_ERROR_UNEXPECTED_EVENT;
        
    nrfx_twis_evt_t evdata;
    evdata.type       = evt;
    evdata.data.error = error;
    
    p_cb->error |= error;
    
    call_event_handler(p_cb, &evdata);
}

static void nrfx_twis_state_machine(NRF_TWIS_Type         *p_reg,
                                    twis_control_block_t *p_cb)
{
    if(!NRFX_TWIS_NO_SYNC_MODE)
    {
        /* Exclude parallel processing of this function */
        if(p_cb->semaphore)
            return;
            
        p_cb->semaphore = 1;
    }
    
    /* Event data structure to be passed into event handler */
    nrfx_twis_evt_t evdata;
    /* Current substate copy  */
    nrfx_twis_substate_t substate = p_cb->substate;
    /* Event flags */
    uint32_t ev = 0;
    
    /* Get all events */
    ev |= nrfx_twis_event_bit_get(p_reg, NRF_TWIS_EVENT_STOPPED);
    ev |= nrfx_twis_event_bit_get(p_reg, NRF_TWIS_EVENT_ERROR);
    ev |= nrfx_twis_event_bit_get(p_reg, NRF_TWIS_EVENT_RXSTARTED);
    ev |= nrfx_twis_event_bit_get(p_reg, NRF_TWIS_EVENT_TXSTARTED);
    ev |= nrfx_twis_event_bit_get(p_reg, NRF_TWIS_EVENT_WRITE);
    ev |= nrfx_twis_event_bit_get(p_reg, NRF_TWIS_EVENT_READ);
    
    /* State machine */
    while(0 != ev)
    {
        switch(substate)
        {
            case NRFX_TWIS_SUBSTATE_IDLE:
                if(nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_STOPPED))
                {
                    /* Stopped event is always allowed in IDLE state - just ignore */
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_STOPPED);
                }
                
                else if(nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_READ))
                {
                    evdata.type = NRFX_TWIS_EVT_READ_REQ;
                    
                    if(nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_TXSTARTED))
                    {
                        substate = NRFX_TWIS_SUBSTATE_READ_PENDING;
                        evdata.data.buf_req = false;
                    }
                    
                    else
                    {
                        substate = NRFX_TWIS_SUBSTATE_READ_WAITING;
                        evdata.data.buf_req = true;
                    }
                    
                    call_event_handler(p_cb, &evdata);
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_READ);
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_TXSTARTED);
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_WRITE);
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_RXSTARTED);
                }
                
                else if(nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_WRITE))
                {
                    evdata.type = NRFX_TWIS_EVT_WRITE_REQ;
                    
                    if(nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_RXSTARTED))
                    {
                        substate = NRFX_TWIS_SUBSTATE_WRITE_PENDING;
                        evdata.data.buf_req = false;
                    }
                    
                    else
                    {
                        substate = NRFX_TWIS_SUBSTATE_WRITE_WAITING;
                        evdata.data.buf_req = true;
                    }
                    
                    call_event_handler(p_cb, &evdata);
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_READ);
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_TXSTARTED);
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_WRITE);
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_RXSTARTED);
                }
                
                else
                {
                    nrfx_twis_process_error(p_cb,
                                            NRFX_TWIS_EVT_GENERAL_ERROR,
                                            nrf_twis_error_source_get_and_clear(p_reg));
                    ev = 0;
                }
                
                break;
                
