hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/drivers/src/nrfx_twis.c
            case NRFX_TWIS_SUBSTATE_READ_WAITING:
                if(nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_TXSTARTED) ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_WRITE)     ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_READ)      ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_STOPPED))
                {
                    substate = NRFX_TWIS_SUBSTATE_READ_PENDING;
                    /* Any other bits requires further processing in PENDING substate */
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_TXSTARTED);
                }
                
                else
                {
                    nrfx_twis_process_error(p_cb,
                                            NRFX_TWIS_EVT_READ_ERROR,
                                            nrf_twis_error_source_get_and_clear(p_reg));
                    substate = NRFX_TWIS_SUBSTATE_IDLE;
                    ev = 0;
                }
                
                break;
                
            case NRFX_TWIS_SUBSTATE_READ_PENDING:
                if(nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_WRITE) ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_READ)  ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_STOPPED))
                {
                    evdata.type = NRFX_TWIS_EVT_READ_DONE;
                    evdata.data.tx_amount = nrf_twis_tx_amount_get(p_reg);
                    NRFX_LOG_INFO("Transfer tx_len:%d", evdata.data.tx_amount);
                    NRFX_LOG_DEBUG("Tx data:");
                    NRFX_LOG_HEXDUMP_DEBUG((uint8_t const *)p_reg->TXD.PTR,
                                           evdata.data.tx_amount * sizeof(uint8_t));
                    call_event_handler(p_cb, &evdata);
                    /*  Go to idle and repeat the state machine if READ or WRITE events detected.
                        This time READ or WRITE would be started */
                    substate = NRFX_TWIS_SUBSTATE_IDLE;
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_STOPPED);
                }
                
                else
                {
                    nrfx_twis_process_error(p_cb,
                                            NRFX_TWIS_EVT_READ_ERROR,
                                            nrf_twis_error_source_get_and_clear(p_reg));
                    substate = NRFX_TWIS_SUBSTATE_IDLE;
                    ev = 0;
                }
                
                break;
                
            case NRFX_TWIS_SUBSTATE_WRITE_WAITING:
                if(nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_RXSTARTED) ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_WRITE)     ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_READ)      ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_STOPPED))
                {
                    substate = NRFX_TWIS_SUBSTATE_WRITE_PENDING;
                    /* Any other bits requires further processing in PENDING substate */
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_RXSTARTED);
                }
                
                else
                {
                    nrfx_twis_process_error(p_cb,
                                            NRFX_TWIS_EVT_WRITE_ERROR,
                                            nrf_twis_error_source_get_and_clear(p_reg));
                    substate = NRFX_TWIS_SUBSTATE_IDLE;
                    ev = 0;
                }
                
                break;
                
            case NRFX_TWIS_SUBSTATE_WRITE_PENDING:
                if(nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_WRITE) ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_READ)  ||
                   nrfx_twis_check_bit(ev, NRF_TWIS_EVENT_STOPPED))
                {
                    evdata.type = NRFX_TWIS_EVT_WRITE_DONE;
                    evdata.data.rx_amount = nrf_twis_rx_amount_get(p_reg);
                    call_event_handler(p_cb, &evdata);
                    /*  Go to idle and repeat the state machine if READ or WRITE events detected.
                        This time READ or WRITE would be started */
                    substate = NRFX_TWIS_SUBSTATE_IDLE;
                    ev = nrfx_twis_clear_bit(ev, NRF_TWIS_EVENT_STOPPED);
                }
                
                else
                {
                    nrfx_twis_process_error(p_cb,
                                            NRFX_TWIS_EVT_WRITE_ERROR,
                                            nrf_twis_error_source_get_and_clear(p_reg));
                    substate = NRFX_TWIS_SUBSTATE_IDLE;
                    ev = 0;
                }
                
                break;
                
            default:
                substate = NRFX_TWIS_SUBSTATE_IDLE;
                /* Do not clear any events and repeat the machine */
                break;
        }
    }
    
    p_cb->substate = substate;
    
    if(!NRFX_TWIS_NO_SYNC_MODE)
        p_cb->semaphore = 0;
}


static inline void nrfx_twis_preprocess_status(nrfx_twis_t const *p_instance)
{
    if(!NRFX_TWIS_NO_SYNC_MODE)
    {
        NRF_TWIS_Type         *p_reg = p_instance->p_reg;
        twis_control_block_t *p_cb  = &m_cb[p_instance->drv_inst_idx];
        
        if(NULL == p_cb->ev_handler)
            nrfx_twis_state_machine(p_reg, p_cb);
    }
}


/*  -------------------------------------------------------------------------
    Implementation of interface functions

*/


nrfx_err_t nrfx_twis_init(nrfx_twis_t const         *p_instance,
                          nrfx_twis_config_t const *p_config,
                          nrfx_twis_event_handler_t  event_handler)
{
    NRFX_ASSERT(p_config);
    NRFX_ASSERT(p_config->scl != p_config->sda);
    nrfx_err_t err_code;
    
    NRF_TWIS_Type         *p_reg = p_instance->p_reg;
    twis_control_block_t *p_cb  = &m_cb[p_instance->drv_inst_idx];
    
    if(p_cb->state != NRFX_DRV_STATE_UNINITIALIZED)
    {
        err_code = NRFX_ERROR_INVALID_STATE;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    
    #if NRFX_CHECK(NRFX_PRS_ENABLED)
    static nrfx_irq_handler_t const irq_handlers[NRFX_TWIS_ENABLED_COUNT] =
    {
        #if NRFX_CHECK(NRFX_TWIS0_ENABLED)
        nrfx_twis_0_irq_handler,
        #endif
        #if NRFX_CHECK(NRFX_TWIS1_ENABLED)
        nrfx_twis_1_irq_handler,
        #endif
    };
    
