hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/drivers/src/nrfx_twis.c
    if(nrfx_prs_acquire(p_reg,
                        irq_handlers[p_instance->drv_inst_idx]) != NRFX_SUCCESS)
    {
        err_code = NRFX_ERROR_BUSY;
        NRFX_LOG_WARNING("Function: %s, error code: %s.",
                         __func__,
                         NRFX_LOG_ERROR_STRING_GET(err_code));
        return err_code;
    }
    
    #endif // NRFX_CHECK(NRFX_PRS_ENABLED)
    
    if(!NRFX_TWIS_ASSUME_INIT_AFTER_RESET_ONLY)
        nrfx_twis_swreset(p_reg);
        
    nrfx_twis_config_pin(p_config->scl, p_config->scl_pull);
    nrfx_twis_config_pin(p_config->sda, p_config->sda_pull);
    
    nrf_twis_config_addr_mask_t addr_mask = (nrf_twis_config_addr_mask_t)0;
    
    if(0 == (p_config->addr[0] | p_config->addr[1]))
        addr_mask = NRF_TWIS_CONFIG_ADDRESS0_MASK;
        
    else
    {
        if(0 != p_config->addr[0])
            addr_mask |= NRF_TWIS_CONFIG_ADDRESS0_MASK;
            
        if(0 != p_config->addr[1])
            addr_mask |= NRF_TWIS_CONFIG_ADDRESS1_MASK;
    }
    
    /*  Peripheral interrupt configure
        (note - interrupts still needs to be configured in INTEN register.
        This is done in enable function) */
    NRFX_IRQ_PRIORITY_SET(nrfx_get_irq_number(p_reg),
                          p_config->interrupt_priority);
    NRFX_IRQ_ENABLE(nrfx_get_irq_number(p_reg));
    
    /* Configure */
    nrf_twis_pins_set(p_reg, p_config->scl, p_config->sda);
    nrf_twis_address_set(p_reg, 0, p_config->addr[0]);
    nrf_twis_address_set(p_reg, 1, p_config->addr[1]);
    nrf_twis_config_address_set(p_reg, addr_mask);
    
    /* Clear semaphore */
    if(!NRFX_TWIS_NO_SYNC_MODE)
        p_cb->semaphore = 0;
        
    /* Set internal instance variables */
    p_cb->substate   = NRFX_TWIS_SUBSTATE_IDLE;
    p_cb->ev_handler = event_handler;
    p_cb->state      = NRFX_DRV_STATE_INITIALIZED;
    err_code = NRFX_SUCCESS;
    NRFX_LOG_INFO("Function: %s, error code: %s.", __func__, NRFX_LOG_ERROR_STRING_GET(err_code));
    return err_code;
}


void nrfx_twis_uninit(nrfx_twis_t const *p_instance)
{
    NRF_TWIS_Type         *p_reg = p_instance->p_reg;
    twis_control_block_t *p_cb  = &m_cb[p_instance->drv_inst_idx];
    NRFX_ASSERT(p_cb->state != NRFX_DRV_STATE_UNINITIALIZED);
    
    TWIS_PSEL_Type psel = p_reg->PSEL;
    
    nrfx_twis_swreset(p_reg);
    
    /* Clear pins state if */
    if(!(TWIS_PSEL_SCL_CONNECT_Msk & psel.SCL))
        nrf_gpio_cfg_default(psel.SCL);
        
    if(!(TWIS_PSEL_SDA_CONNECT_Msk & psel.SDA))
        nrf_gpio_cfg_default(psel.SDA);
        
    #if NRFX_CHECK(NRFX_PRS_ENABLED)
    nrfx_prs_release(p_reg);
    #endif
    
    /* Clear variables */
    p_cb->ev_handler = NULL;
    p_cb->state      = NRFX_DRV_STATE_UNINITIALIZED;
}


void nrfx_twis_enable(nrfx_twis_t const *p_instance)
{
    NRF_TWIS_Type         *p_reg = p_instance->p_reg;
    twis_control_block_t *p_cb  = &m_cb[p_instance->drv_inst_idx];
    NRFX_ASSERT(p_cb->state == NRFX_DRV_STATE_INITIALIZED);
    
    nrfx_twis_clear_all_events(p_reg);
    
    /* Enable interrupts */
    if(NULL != p_cb->ev_handler)
        nrf_twis_int_enable(p_reg, m_used_ints_mask);
        
    nrf_twis_enable(p_reg);
    p_cb->error    = 0;
    p_cb->state    = NRFX_DRV_STATE_POWERED_ON;
    p_cb->substate = NRFX_TWIS_SUBSTATE_IDLE;
}


void nrfx_twis_disable(nrfx_twis_t const *p_instance)
{
    NRF_TWIS_Type         *p_reg = p_instance->p_reg;
    twis_control_block_t *p_cb  = &m_cb[p_instance->drv_inst_idx];
    NRFX_ASSERT(p_cb->state != NRFX_DRV_STATE_UNINITIALIZED);
    
    nrf_twis_int_disable(p_reg, m_used_ints_mask);
    
    nrf_twis_disable(p_reg);
    p_cb->state = NRFX_DRV_STATE_INITIALIZED;
}

/*  ARM recommends not using the LDREX and STREX instructions in C code.
    This is because the compiler might generate loads and stores between
    LDREX and STREX, potentially clearing the exclusive monitor set by LDREX.
    This recommendation also applies to the byte, halfword, and doubleword
    variants LDREXB, STREXB, LDREXH, STREXH, LDREXD, and STREXD.

    This is the reason for the function below to be implemented in assembly.
*/
//lint -save -e578
#if defined (__CC_ARM )
static __ASM uint32_t nrfx_twis_error_get_and_clear_internal(uint32_t volatile *perror)
{
    mov   r3, r0
    mov   r1, #0
    nrfx_twis_error_get_and_clear_internal_try
    ldrex r0, [r3]
    strex r2, r1, [r3]
    cmp   r2, r1                                     /* did this succeed?       */
    bne   nrfx_twis_error_get_and_clear_internal_try /* no - try again          */
    bx    lr
}
#elif defined ( __GNUC__ )
static uint32_t nrfx_twis_error_get_and_clear_internal(uint32_t volatile *perror)
{
    uint32_t ret;
    uint32_t temp;
    __ASM volatile(
        "   .syntax unified           \n"
        "nrfx_twis_error_get_and_clear_internal_try:         \n"
        "   ldrex %[ret], [%[perror]]                        \n"
        "   strex %[temp], %[zero], [%[perror]]              \n"
        "   cmp   %[temp], %[zero]                           \n"
        "   bne   nrfx_twis_error_get_and_clear_internal_try \n"
        : /* Output */
        [ret]"=&l"(ret),
        [temp]"=&l"(temp)
        : /* Input */
        [zero]"l"(0),
        [perror]"l"(perror)
    );
    (void)temp;
    return ret;
}
#elif defined ( __ICCARM__ )
static uint32_t nrfx_twis_error_get_and_clear_internal(uint32_t volatile *perror)
{
    uint32_t ret;
    uint32_t temp;
    __ASM volatile(
        "1:         \n"
        "   ldrex %[ret], [%[perror]]                           \n"
        "   strex %[temp], %[zero], [%[perror]]                 \n"
        "   cmp   %[temp], %[zero]                              \n"
        "   bne.n 1b \n"
        : /* Output */
        [ret]"=&l"(ret),
        [temp]"=&l"(temp)
        : /* Input */
        [zero]"l"(0),
        [perror]"l"(perror)
    );
    (void)temp;
    return ret;
}
#else
#error Unknown compiler
#endif
//lint -restore

uint32_t nrfx_twis_error_get_and_clear(nrfx_twis_t const *p_instance)
{
    nrfx_twis_preprocess_status(p_instance);
    /*  Make sure that access to error member is atomic
        so there is no bit that is cleared if it is not copied to local variable already. */
    twis_control_block_t *p_cb  = &m_cb[p_instance->drv_inst_idx];
    return nrfx_twis_error_get_and_clear_internal(&p_cb->error);
}


